-GROUP DDL
-DATASET CSV empty

--

-CASE AddNodeProperty
-STATEMENT create node table Comment (id int64, PRIMARY KEY (id));
---- ok
-STATEMENT copy Comment from '${KUZU_ROOT_DIRECTORY}/dataset/sf-0.1/Comment.csv' (HEADER=true, DELIM='|');
---- ok
-STATEMENT alter table Comment add propx int64;
---- ok
-STATEMENT MATCH (c:Comment) RETURN SUM(c.propx);
---- 1

-STATEMENT alter table Comment add propy int64 default 1;
---- ok
-STATEMENT MATCH (c:Comment) RETURN SUM(c.propy);
---- 1
215488

-CASE AddRelProperty
-STATEMENT create node table Comment (id int64, PRIMARY KEY (id));
---- ok
-STATEMENT create rel table replyOf (FROM Comment TO Comment, MANY_ONE);
---- ok
-STATEMENT copy Comment from '${KUZU_ROOT_DIRECTORY}/dataset/sf-0.1/Comment.csv' (HEADER=true, DELIM='|');
---- ok
-STATEMENT copy replyOf from '${KUZU_ROOT_DIRECTORY}/dataset/sf-0.1/Comment_replyOf_Comment.csv' (HEADER=true, DELIM='|');
---- ok
-STATEMENT alter table replyOf add propx int64;
---- ok
-STATEMENT MATCH (c:Comment)-[r:replyOf]->(c2:Comment) RETURN SUM(r.propx);
---- 1

-STATEMENT alter table replyOf add propy int64 default 1;
---- ok
-STATEMENT MATCH (c:Comment)-[r:replyOf]->(c2:Comment) RETURN SUM(r.propy);
---- 1
108027

-CASE SerialAddNodeProperty
-STATEMENT create node table Person (ID SERIAL, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, PRIMARY KEY (ID));
---- ok
-STATEMENT copy Person from '${KUZU_ROOT_DIRECTORY}/dataset/tinysnb-serial/vPerson.csv' (HeaDER=true, deLim=',');
---- ok
-STATEMENT alter table Person add propx int64 default 1;
---- ok
-STATEMENT MATCH (p:Person) RETURN SUM(p.propx);
---- 1
8
