-GROUP RdfoxExample
-DATASET TTL rdf/rdfox_example

--

-CASE Basic
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 5
example_literal_triples_t|REL|
example_literal_t|NODE|
example_resource_triples_t|REL|
example_resource_t|NODE|
example|RDF|

-STATEMENT MATCH (s:example_resource_t) RETURN s._iri ORDER BY offset(id(s));
-CHECK_ORDER
---- 14
:peter
:forename
http://www.w3.org/1999/02/22-rdf-syntax-ns#type
:Person
:marriedTo
:lois
:gender
:meg
:hasParent
:chris
:stewie
:brian
:andy
:age

-STATEMENT MATCH (s:example_literal_t) RETURN s.* ORDER BY offset(id(s));
-CHECK_ORDER
---- 12
0|Peter
1|male
2|Lois
3|female
4|Meg
5|female
6|Chris
7|male
8|Stewie
9|male
10|Brian
11|12

-STATEMENT MATCH (a:example)-[e:example]->(b:example) RETURN a._iri, e._iri, b._iri
---- 22
:andy|:age|12
:brian|:forename|Brian
:chris|:forename|Chris
:chris|:gender|male
:chris|:hasParent|:peter
:chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:lois|:forename|Lois
:lois|:gender|female
:lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:meg|:forename|Meg
:meg|:gender|female
:meg|:hasParent|:lois
:meg|:hasParent|:peter
:meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:peter|:forename|Peter
:peter|:gender|male
:peter|:marriedTo|:lois
:peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:stewie|:forename|Stewie
:stewie|:gender|male
:stewie|:hasParent|:lois
:stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person

-STATEMENT MATCH (a:example)-[e:example]->(b:example)-[e2:example]->(c:example) RETURN a._iri, e._iri, b._iri
